from enum import Enum
from typing import Any, Callable


def style(obj: Any, *styles: str) -> str:
    if styles:
        return '\033[' + ';'.join(styles) + 'm' + str(obj) + '\033[0m'
    return str(obj)

def style_wrap(*styles: str) -> Callable[..., str]:
    s = '\033[' + ';'.join(styles) + 'm'
    def wrap(obj: Any) -> str:
        return s + str(obj) + '\033[0m'
    return wrap

def rgb(obj: Any, r: int, g: int, b: int, fg: bool = True) -> str:
    m = '38' if fg else '48'
    return f'\033[{m};2;{r};{g};{b}m' + str(obj) + '\033[0m'

def _default_color(code: int) -> Callable[..., str]:
    c = f'\033[{code}'
    del code
    def wrap(obj: Any) -> str:
        return c + str(obj) + '\033[0m'
    return wrap

def rgb_wrap(r: int, g: int, b: int, fg: bool = True) -> Callable[..., str]:
    c = '\033[' + ('38' if fg else '48') + f';2;{r};{g};{b}m'
    del r, g, b, fg
    def wrap(obj: Any) -> str:
        return c + str(obj) + '\033[0m'
    return wrap

_dc = _default_color
_cc = rgb_wrap

class C8(Enum):
    # bg
    b_k = _dc(40)
    '''## 黑色'''
    b_r = _dc(41)
    '''## 红色'''
    b_g = _dc(42)
    '''## 绿色'''
    b_y = _dc(43)
    '''## 黄色'''
    b_e = _dc(44)
    '''## 蓝色'''
    b_m = _dc(45)
    '''## 紫色'''
    b_c = _dc(46)
    '''## 青色'''
    b_w = _dc(47)
    '''## 白色'''
    b_lk = _dc(100)
    '''## 亮黑色'''
    b_lr = _dc(101)
    '''## 亮红色'''
    b_lg = _dc(102)
    '''## 亮绿色'''
    b_ly = _dc(103)
    '''## 亮黄色'''
    b_le = _dc(104)
    '''## 亮蓝色'''
    b_lm = _dc(105)
    '''## 亮紫色'''
    b_lc = _dc(106)
    '''## 亮青色'''
    b_lw = _dc(107)
    '''## 亮白色'''
    # fg
    f_k = _dc(30)
    '''## 黑色'''
    f_r = _dc(31)
    '''## 红色'''
    f_g = _dc(32)
    '''## 绿色'''
    f_y = _dc(33)
    '''## 黄色'''
    f_e = _dc(34)
    '''## 蓝色'''
    f_m = _dc(35)
    '''## 紫色'''
    f_c = _dc(36)
    '''## 青色'''
    f_w = _dc(37)
    '''## 白色'''
    f_lk = _dc(90)
    '''## 亮黑色'''
    f_lr = _dc(91)
    '''## 亮红色'''
    f_lg = _dc(92)
    '''## 亮绿色'''
    f_ly = _dc(93)
    '''## 亮黄色'''
    f_le = _dc(94)
    '''## 亮蓝色'''
    f_lm = _dc(95)
    '''## 亮紫色'''
    f_lc = _dc(96)
    '''## 亮青色'''
    f_lw = _dc(97)
    '''## 亮白色'''

class C256(Enum):
    # bg
    b_003a6c = _cc(0, 58, 108, False)
    '''## 绀色'''
    b_005344 = _cc(0, 83, 68, False)
    '''## 铁色'''
    b_005831 = _cc(0, 88, 49, False)
    '''## 深緑色'''
    b_006c54 = _cc(0, 108, 84, False)
    '''## 萌葱色'''
    b_007947 = _cc(0, 121, 71, False)
    '''## 常盘色'''
    b_007d65 = _cc(0, 125, 101, False)
    '''## 青緑色'''
    b_008792 = _cc(0, 135, 146, False)
    '''## 御纳戸色'''
    b_009ad6 = _cc(0, 154, 214, False)
    '''## 青色'''
    b_00a6ac = _cc(0, 166, 172, False)
    '''## 浅葱色'''
    b_00ae9d = _cc(0, 174, 157, False)
    '''## 青緑色'''
    b_0c212b = _cc(12, 33, 43, False)
    '''## 褐返色'''
    b_102b6a = _cc(16, 43, 106, False)
    '''## 青蓝色'''
    b_11264f = _cc(17, 38, 79, False)
    '''## 浓蓝色'''
    b_121a2a = _cc(18, 26, 42, False)
    '''## 青褐色'''
    b_122e29 = _cc(18, 46, 41, False)
    '''## 锖鼠色'''
    b_130c0e = _cc(19, 12, 14, False)
    '''## 黑色'''
    b_145b7d = _cc(20, 91, 125, False)
    '''## 蓝色'''
    b_181d4b = _cc(24, 29, 75, False)
    '''## 铁绀色'''
    b_1a2933 = _cc(26, 41, 51, False)
    '''## 蓝铁色'''
    b_1b315e = _cc(27, 49, 94, False)
    '''## 绀青色'''
    b_1d1626 = _cc(29, 22, 38, False)
    '''## 紫黑色'''
    b_1d953f = _cc(29, 149, 63, False)
    '''## 薄緑色'''
    b_224b8f = _cc(34, 75, 143, False)
    '''## 琉璃绀色'''
    b_225a1f = _cc(34, 90, 31, False)
    '''## 草色'''
    b_228fbd = _cc(34, 143, 189, False)
    '''## 缥色'''
    b_2468a2 = _cc(36, 104, 162, False)
    '''## 浅缥色'''
    b_2570a1 = _cc(37, 112, 161, False)
    '''## 薄缥色'''
    b_2585a6 = _cc(37, 133, 166, False)
    '''## 薄花色'''
    b_27342b = _cc(39, 52, 43, False)
    '''## 仙斎茶色'''
    b_274d3d = _cc(39, 77, 61, False)
    '''## 革色'''
    b_281f1d = _cc(40, 31, 29, False)
    '''## 黑铁色'''
    b_293047 = _cc(41, 48, 71, False)
    '''## 铁御纳戸色'''
    b_2a5caa = _cc(42, 92, 170, False)
    '''## 瑠璃色'''
    b_2b4490 = _cc(43, 68, 144, False)
    '''## 花色'''
    b_2b6447 = _cc(43, 100, 71, False)
    '''## 千歳緑色'''
    b_2e3a1f = _cc(46, 58, 31, False)
    '''## 蓝海松茶色'''
    b_2f271d = _cc(47, 39, 29, False)
    '''## 蝋色'''
    b_33a3dc = _cc(51, 163, 220, False)
    '''## 露草色'''
    b_367459 = _cc(54, 116, 89, False)
    '''## 木贼色'''
    b_375830 = _cc(55, 88, 48, False)
    '''## 青白橡色'''
    b_375830 = _cc(55, 88, 48, False)
    '''## 麹尘色'''
    b_3c3645 = _cc(60, 54, 69, False)
    '''## 浓鼠色'''
    b_3e4145 = _cc(62, 65, 69, False)
    '''## 黑橡色'''
    b_401c44 = _cc(64, 28, 68, False)
    '''## 暗红色'''
    b_402e4c = _cc(64, 46, 76, False)
    '''## 二蓝色'''
    b_40835e = _cc(64, 131, 94, False)
    '''## 緑青色'''
    b_411445 = _cc(65, 20, 69, False)
    '''## 紫绀色'''
    b_412f1f = _cc(65, 47, 31, False)
    '''## 涅色'''
    b_426ab3 = _cc(66, 106, 179, False)
    '''## 杜若色'''
    b_444693 = _cc(68, 70, 147, False)
    '''## 绀桔梗色'''
    b_45224a = _cc(69, 34, 74, False)
    '''## 茄子绀色'''
    b_454926 = _cc(69, 73, 38, False)
    '''## 媚茶色'''
    b_45b97c = _cc(69, 185, 124, False)
    '''## 绿色'''
    b_464547 = _cc(70, 69, 71, False)
    '''## 墨色'''
    b_46485f = _cc(70, 72, 95, False)
    '''## 胜色'''
    b_472d56 = _cc(71, 45, 86, False)
    '''## 葡萄色'''
    b_494e8f = _cc(73, 78, 143, False)
    '''## 绀蓝色'''
    b_4a3113 = _cc(74, 49, 19, False)
    '''## 银煤竹色'''
    b_4b2f3d = _cc(75, 47, 61, False)
    '''## 浓色'''
    b_4d4f36 = _cc(77, 79, 54, False)
    '''## 青钝色'''
    b_4e72b8 = _cc(78, 114, 184, False)
    '''## 群青色'''
    b_4f5555 = _cc(79, 85, 85, False)
    '''## 钝色'''
    b_508a88 = _cc(80, 138, 136, False)
    '''## 锖浅葱色'''
    b_50b7c1 = _cc(80, 183, 193, False)
    '''## 新桥色'''
    b_525f42 = _cc(82, 95, 66, False)
    '''## 山鸠色'''
    b_53261f = _cc(83, 38, 31, False)
    '''## 赤褐色'''
    b_54211d = _cc(84, 33, 29, False)
    '''## 深绯色'''
    b_543044 = _cc(84, 48, 68, False)
    '''## 灭紫色'''
    b_563624 = _cc(86, 54, 36, False)
    '''## 黑茶色'''
    b_56452d = _cc(86, 69, 45, False)
    '''## 黄枯茶色'''
    b_585eaa = _cc(88, 94, 170, False)
    '''## 桔梗色'''
    b_594c6d = _cc(89, 76, 109, False)
    '''## 鸠羽鼠色'''
    b_596032 = _cc(89, 96, 50, False)
    '''## 鶸茶色'''
    b_5c7a29 = _cc(92, 122, 41, False)
    '''## 苔色'''
    b_5e7c85 = _cc(94, 124, 133, False)
    '''## 蓝鼠色'''
    b_5f3c23 = _cc(95, 60, 35, False)
    '''## 枯茶色'''
    b_5f5d46 = _cc(95, 93, 70, False)
    '''## 生壁色'''
    b_63434f = _cc(99, 67, 79, False)
    '''## 葡萄鼠色'''
    b_64492b = _cc(100, 73, 43, False)
    '''## 黄栌色'''
    b_65c294 = _cc(101, 194, 148, False)
    '''## 若竹色'''
    b_694d9f = _cc(105, 77, 159, False)
    '''## 菖蒲色'''
    b_6950a1 = _cc(105, 80, 161, False)
    '''## 青紫色'''
    b_69541b = _cc(105, 84, 27, False)
    '''## 国防色'''
    b_6a3427 = _cc(106, 52, 39, False)
    '''## 锖色'''
    b_6a6da9 = _cc(106, 109, 169, False)
    '''## 藤纳戸色'''
    b_6b2c25 = _cc(107, 44, 37, False)
    '''## 栗梅色'''
    b_6b473c = _cc(107, 71, 60, False)
    '''## 焦茶色'''
    b_6c4c49 = _cc(108, 76, 73, False)
    '''## 煤竹色'''
    b_6d5826 = _cc(109, 88, 38, False)
    '''## 莺茶色'''
    b_6d8346 = _cc(109, 131, 70, False)
    '''## 草色'''
    b_6e6b41 = _cc(110, 107, 65, False)
    '''## 海松色'''
    b_6f599c = _cc(111, 89, 156, False)
    '''## 江戸紫色'''
    b_6f60aa = _cc(111, 96, 170, False)
    '''## 菫色'''
    b_6f6d85 = _cc(111, 109, 133, False)
    '''## 薄鼠色'''
    b_705628 = _cc(112, 86, 40, False)
    '''## 黄橡色'''
    b_70a19f = _cc(112, 161, 159, False)
    '''## 水浅葱色'''
    b_726930 = _cc(114, 105, 48, False)
    '''## 利久色'''
    b_72777b = _cc(114, 119, 123, False)
    '''## 铅色'''
    b_72baa7 = _cc(114, 186, 167, False)
    '''## 青竹色'''
    b_733a31 = _cc(115, 58, 49, False)
    '''## 海老茶色'''
    b_73b9a2 = _cc(115, 185, 162, False)
    '''## 青磁色'''
    b_74787c = _cc(116, 120, 124, False)
    '''## 薄墨色'''
    b_74905d = _cc(116, 144, 93, False)
    '''## 松叶色'''
    b_76624c = _cc(118, 98, 76, False)
    '''## 空五倍子色'''
    b_769149 = _cc(118, 145, 73, False)
    '''## 苗色'''
    b_76becc = _cc(118, 190, 204, False)
    '''## 秘色'''
    b_77787b = _cc(119, 120, 123, False)
    '''## 灰色'''
    b_77ac98 = _cc(119, 172, 152, False)
    '''## 千草色'''
    b_78331e = _cc(120, 51, 30, False)
    '''## 赤铜色'''
    b_78a355 = _cc(120, 163, 85, False)
    '''## 柳色'''
    b_78cdd1 = _cc(120, 205, 209, False)
    '''## 白群色'''
    b_7a1723 = _cc(122, 23, 35, False)
    '''## 绯色'''
    b_7bbfea = _cc(123, 191, 234, False)
    '''## 勿忘草色'''
    b_7c8577 = _cc(124, 133, 119, False)
    '''## 利休鼠色'''
    b_7d5886 = _cc(125, 88, 134, False)
    '''## 古代紫色'''
    b_7f7522 = _cc(127, 117, 34, False)
    '''## 伽罗色'''
    b_7fb80e = _cc(127, 184, 14, False)
    '''## 若緑色'''
    b_80752c = _cc(128, 117, 44, False)
    '''## 青丹色'''
    b_817936 = _cc(129, 121, 54, False)
    '''## 油色'''
    b_826858 = _cc(130, 104, 88, False)
    '''## 丁子茶色'''
    b_840228 = _cc(132, 2, 40, False)
    '''## 真红色'''
    b_84331f = _cc(132, 51, 31, False)
    '''## 赤锖色'''
    b_843900 = _cc(132, 57, 0, False)
    '''## 褐色'''
    b_845538 = _cc(132, 85, 56, False)
    '''## 胡桃色'''
    b_84bf96 = _cc(132, 191, 150, False)
    '''## 浅緑色'''
    b_853f04 = _cc(133, 63, 4, False)
    '''## 焦香色'''
    b_8552a1 = _cc(133, 82, 161, False)
    '''## 紫色'''
    b_867892 = _cc(134, 120, 146, False)
    '''## 鸠羽色'''
    b_87481f = _cc(135, 72, 31, False)
    '''## 桦茶色'''
    b_87843b = _cc(135, 132, 59, False)
    '''## 莺色'''
    b_892f1b = _cc(137, 47, 27, False)
    '''## 弁柄色'''
    b_896a45 = _cc(137, 106, 69, False)
    '''## 朽叶色'''
    b_8a2e3b = _cc(138, 46, 59, False)
    '''## 浅苏芳色'''
    b_8a5d19 = _cc(138, 93, 25, False)
    '''## 饴色'''
    b_8a8c8e = _cc(138, 140, 142, False)
    '''## 鼠色'''
    b_8c531b = _cc(140, 83, 27, False)
    '''## 丁子色'''
    b_8e3e1f = _cc(142, 62, 31, False)
    '''## 栗色'''
    b_8e453f = _cc(142, 69, 63, False)
    '''## 鸢色'''
    b_8e7437 = _cc(142, 116, 55, False)
    '''## 香色'''
    b_8f4b2e = _cc(143, 75, 46, False)
    '''## 茶色'''
    b_8f4b38 = _cc(143, 75, 56, False)
    '''## 桧皮色'''
    b_8f4b4a = _cc(143, 75, 74, False)
    '''## 小豆色'''
    b_905a3d = _cc(144, 90, 61, False)
    '''## 灰茶色'''
    b_905d1d = _cc(144, 93, 29, False)
    '''## 路考茶色'''
    b_90d7ec = _cc(144, 215, 236, False)
    '''## 空色'''
    b_918597 = _cc(145, 133, 151, False)
    '''## 薄色'''
    b_94d6da = _cc(148, 214, 218, False)
    '''## 瓮覗色'''
    b_96582a = _cc(150, 88, 42, False)
    '''## 狐色'''
    b_973c3f = _cc(151, 60, 63, False)
    '''## 苏芳色'''
    b_987165 = _cc(152, 113, 101, False)
    '''## 梅染色'''
    b_999d9c = _cc(153, 157, 156, False)
    '''## 薄钝色'''
    b_9b95c9 = _cc(155, 149, 201, False)
    '''## 藤紫色'''
    b_9d9087 = _cc(157, 144, 135, False)
    '''## 茶鼠色'''
    b_a03939 = _cc(160, 57, 57, False)
    '''## 红海老茶色'''
    b_a1a3a6 = _cc(161, 163, 166, False)
    '''## 银鼠色'''
    b_a3cf62 = _cc(163, 207, 98, False)
    '''## 萌黄色'''
    b_a7324a = _cc(167, 50, 74, False)
    '''## 红色'''
    b_a7573b = _cc(167, 87, 59, False)
    '''## 赭色'''
    b_aa2116 = _cc(170, 33, 22, False)
    '''## 绯色'''
    b_aa363d = _cc(170, 54, 61, False)
    '''## 银朱色'''
    b_abc88b = _cc(171, 200, 139, False)
    '''## 若草色'''
    b_ac6767 = _cc(172, 103, 103, False)
    '''## 退红色'''
    b_ad8b3d = _cc(173, 139, 61, False)
    '''## 木兰色'''
    b_ae5039 = _cc(174, 80, 57, False)
    '''## 炼瓦色'''
    b_ae6642 = _cc(174, 102, 66, False)
    '''## 土器色'''
    b_afb4db = _cc(175, 180, 219, False)
    '''## 藤色'''
    b_afdfe4 = _cc(175, 223, 228, False)
    '''## 水色'''
    b_b22c46 = _cc(178, 44, 70, False)
    '''## 茜色'''
    b_b2d235 = _cc(178, 210, 53, False)
    '''## 黄緑色'''
    b_b3424a = _cc(179, 66, 74, False)
    '''## 臙脂色'''
    b_b36d41 = _cc(179, 109, 65, False)
    '''## 土色'''
    b_b4532a = _cc(180, 83, 42, False)
    '''## 代赭色'''
    b_b4533c = _cc(180, 83, 60, False)
    '''## 赤茶色'''
    b_b4534b = _cc(180, 83, 75, False)
    '''## 红桦色'''
    b_b54334 = _cc(181, 67, 52, False)
    '''## 土色'''
    b_b64533 = _cc(182, 69, 51, False)
    '''## 丹色'''
    b_b69968 = _cc(182, 153, 104, False)
    '''## 亜麻色'''
    b_b76f40 = _cc(183, 111, 64, False)
    '''## 琥珀色'''
    b_b7704f = _cc(183, 112, 79, False)
    '''## 骆驼色'''
    b_b7ba6b = _cc(183, 186, 107, False)
    '''## 抹茶色'''
    b_ba8448 = _cc(186, 132, 72, False)
    '''## 黄土色'''
    b_bb505d = _cc(187, 80, 93, False)
    '''## 今様色'''
    b_bd6758 = _cc(189, 103, 88, False)
    '''## 曙色'''
    b_bed742 = _cc(190, 215, 66, False)
    '''## 若草色'''
    b_c1a173 = _cc(193, 161, 115, False)
    '''## 枯色'''
    b_c37e00 = _cc(195, 126, 0, False)
    '''## 黄金色'''
    b_c37e00 = _cc(195, 126, 0, False)
    '''## 金色'''
    b_c63c26 = _cc(198, 60, 38, False)
    '''## 桦色'''
    b_c76968 = _cc(199, 105, 104, False)
    '''## 真赭色'''
    b_c77eb5 = _cc(199, 126, 181, False)
    '''## 菖蒲色'''
    b_c7a252 = _cc(199, 162, 82, False)
    '''## 芥子色'''
    b_c85d44 = _cc(200, 93, 68, False)
    '''## 桦色'''
    b_c88400 = _cc(200, 132, 0, False)
    '''## 萱草色'''
    b_c99979 = _cc(201, 153, 121, False)
    '''## 洗柿色'''
    b_ca8687 = _cc(202, 134, 135, False)
    '''## 薄柿色'''
    b_cbc547 = _cc(203, 197, 71, False)
    '''## 鶸色'''
    b_cd9a5b = _cc(205, 154, 91, False)
    '''## 肉色'''
    b_cd9a5b = _cc(205, 154, 91, False)
    '''## 人色'''
    b_cde6c7 = _cc(205, 230, 199, False)
    '''## 白緑色'''
    b_d1923f = _cc(209, 146, 63, False)
    '''## 朽叶色'''
    b_d1c7b7 = _cc(209, 199, 183, False)
    '''## 石竹色'''
    b_d2553d = _cc(210, 85, 61, False)
    '''## 洗朱色'''
    b_d3c6a6 = _cc(211, 198, 166, False)
    '''## 砂色'''
    b_d3d7d4 = _cc(211, 215, 212, False)
    '''## 乳白色'''
    b_d5c59f = _cc(213, 197, 159, False)
    '''## 练色'''
    b_d64f44 = _cc(214, 79, 68, False)
    '''## 赤丹色'''
    b_d71345 = _cc(215, 19, 69, False)
    '''## 红色'''
    b_d93a49 = _cc(217, 58, 73, False)
    '''## 红赤色'''
    b_d9d6c3 = _cc(217, 214, 195, False)
    '''## 灰白色'''
    b_da765b = _cc(218, 118, 91, False)
    '''## 肉桂色'''
    b_dbce8f = _cc(219, 206, 143, False)
    '''## 鸟子色'''
    b_de773f = _cc(222, 119, 63, False)
    '''## 黄茶色'''
    b_dea32c = _cc(222, 163, 44, False)
    '''## 栀子色'''
    b_deab8a = _cc(222, 171, 138, False)
    '''## 赤白橡色'''
    b_dec674 = _cc(222, 198, 116, False)
    '''## 淡黄色'''
    b_decb00 = _cc(222, 203, 0, False)
    '''## 緑黄色'''
    b_df9464 = _cc(223, 148, 100, False)
    '''## 小麦色'''
    b_e0861a = _cc(224, 134, 26, False)
    '''## 金茶色'''
    b_ea66a6 = _cc(234, 102, 166, False)
    '''## 牡丹色'''
    b_ed1941 = _cc(237, 25, 65, False)
    '''## 赤色'''
    b_ef4136 = _cc(239, 65, 54, False)
    '''## 红绯色'''
    b_ef5b9c = _cc(239, 91, 156, False)
    '''## 踯躅色'''
    b_f05b72 = _cc(240, 91, 114, False)
    '''## 蔷薇色'''
    b_f0dc70 = _cc(240, 220, 112, False)
    '''## 刈安色'''
    b_f15a22 = _cc(241, 90, 34, False)
    '''## 金赤色'''
    b_f15a22 = _cc(241, 90, 34, False)
    '''## 赤橙色'''
    b_f15b6c = _cc(241, 91, 108, False)
    '''## 韩红色'''
    b_f173ac = _cc(241, 115, 172, False)
    '''## 赤紫色'''
    b_f26522 = _cc(242, 101, 34, False)
    '''## 朱色'''
    b_f2eada = _cc(242, 234, 218, False)
    '''## 象牙色'''
    b_f36c21 = _cc(243, 108, 33, False)
    '''## 黄赤色'''
    b_f3704b = _cc(243, 112, 75, False)
    '''## 柿色'''
    b_f3715c = _cc(243, 113, 92, False)
    '''## 铅丹色'''
    b_f391a9 = _cc(243, 145, 169, False)
    '''## 薄红梅色'''
    b_f47920 = _cc(244, 121, 32, False)
    '''## 橙色'''
    b_f47a55 = _cc(244, 122, 85, False)
    '''## 黄丹色'''
    b_f58220 = _cc(245, 130, 32, False)
    '''## 蜜柑色'''
    b_f58f98 = _cc(245, 143, 152, False)
    '''## 桃色'''
    b_f69c9f = _cc(246, 156, 159, False)
    '''## 红梅色'''
    b_f6f5ec = _cc(246, 245, 236, False)
    '''## 生成色'''
    b_f7acbc = _cc(247, 172, 188, False)
    '''## 鸨色'''
    b_f8aba6 = _cc(248, 171, 166, False)
    '''## 珊瑚色'''
    b_faa755 = _cc(250, 167, 85, False)
    '''## 柑子色'''
    b_fab27b = _cc(250, 178, 123, False)
    '''## 杏色'''
    b_fcaf17 = _cc(252, 175, 23, False)
    '''## 山吹色'''
    b_fcf16e = _cc(252, 241, 110, False)
    '''## 黄檗色'''
    b_fdb933 = _cc(253, 185, 51, False)
    '''## 郁金色'''
    b_fedcbd = _cc(254, 220, 189, False)
    '''## 肌色'''
    b_feeeed = _cc(254, 238, 237, False)
    '''## 桜色'''
    b_ffc20e = _cc(255, 194, 14, False)
    '''## 向日葵色'''
    b_ffce7b = _cc(255, 206, 123, False)
    '''## 卵色'''
    b_ffd400 = _cc(255, 212, 0, False)
    '''## 黄色'''
    b_ffd400 = _cc(255, 212, 0, False)
    '''## 蒲公英色'''
    b_ffe600 = _cc(255, 230, 0, False)
    '''## 中黄色'''
    b_fffef9 = _cc(255, 254, 249, False)
    '''## 胡粉色'''
    b_fffffb = _cc(255, 255, 251, False)
    '''## 白色'''
    # fg
    f_003a6c = _cc(0, 58, 108, True)
    '''## 绀色'''
    f_005344 = _cc(0, 83, 68, True)
    '''## 铁色'''
    f_005831 = _cc(0, 88, 49, True)
    '''## 深緑色'''
    f_006c54 = _cc(0, 108, 84, True)
    '''## 萌葱色'''
    f_007947 = _cc(0, 121, 71, True)
    '''## 常盘色'''
    f_007d65 = _cc(0, 125, 101, True)
    '''## 青緑色'''
    f_008792 = _cc(0, 135, 146, True)
    '''## 御纳戸色'''
    f_009ad6 = _cc(0, 154, 214, True)
    '''## 青色'''
    f_00a6ac = _cc(0, 166, 172, True)
    '''## 浅葱色'''
    f_00ae9d = _cc(0, 174, 157, True)
    '''## 青緑色'''
    f_0c212b = _cc(12, 33, 43, True)
    '''## 褐返色'''
    f_102b6a = _cc(16, 43, 106, True)
    '''## 青蓝色'''
    f_11264f = _cc(17, 38, 79, True)
    '''## 浓蓝色'''
    f_121a2a = _cc(18, 26, 42, True)
    '''## 青褐色'''
    f_122e29 = _cc(18, 46, 41, True)
    '''## 锖鼠色'''
    f_130c0e = _cc(19, 12, 14, True)
    '''## 黑色'''
    f_145b7d = _cc(20, 91, 125, True)
    '''## 蓝色'''
    f_181d4b = _cc(24, 29, 75, True)
    '''## 铁绀色'''
    f_1a2933 = _cc(26, 41, 51, True)
    '''## 蓝铁色'''
    f_1b315e = _cc(27, 49, 94, True)
    '''## 绀青色'''
    f_1d1626 = _cc(29, 22, 38, True)
    '''## 紫黑色'''
    f_1d953f = _cc(29, 149, 63, True)
    '''## 薄緑色'''
    f_224b8f = _cc(34, 75, 143, True)
    '''## 琉璃绀色'''
    f_225a1f = _cc(34, 90, 31, True)
    '''## 草色'''
    f_228fbd = _cc(34, 143, 189, True)
    '''## 缥色'''
    f_2468a2 = _cc(36, 104, 162, True)
    '''## 浅缥色'''
    f_2570a1 = _cc(37, 112, 161, True)
    '''## 薄缥色'''
    f_2585a6 = _cc(37, 133, 166, True)
    '''## 薄花色'''
    f_27342b = _cc(39, 52, 43, True)
    '''## 仙斎茶色'''
    f_274d3d = _cc(39, 77, 61, True)
    '''## 革色'''
    f_281f1d = _cc(40, 31, 29, True)
    '''## 黑铁色'''
    f_293047 = _cc(41, 48, 71, True)
    '''## 铁御纳戸色'''
    f_2a5caa = _cc(42, 92, 170, True)
    '''## 瑠璃色'''
    f_2b4490 = _cc(43, 68, 144, True)
    '''## 花色'''
    f_2b6447 = _cc(43, 100, 71, True)
    '''## 千歳緑色'''
    f_2e3a1f = _cc(46, 58, 31, True)
    '''## 蓝海松茶色'''
    f_2f271d = _cc(47, 39, 29, True)
    '''## 蝋色'''
    f_33a3dc = _cc(51, 163, 220, True)
    '''## 露草色'''
    f_367459 = _cc(54, 116, 89, True)
    '''## 木贼色'''
    f_375830 = _cc(55, 88, 48, True)
    '''## 青白橡色'''
    f_375830 = _cc(55, 88, 48, True)
    '''## 麹尘色'''
    f_3c3645 = _cc(60, 54, 69, True)
    '''## 浓鼠色'''
    f_3e4145 = _cc(62, 65, 69, True)
    '''## 黑橡色'''
    f_401c44 = _cc(64, 28, 68, True)
    '''## 暗红色'''
    f_402e4c = _cc(64, 46, 76, True)
    '''## 二蓝色'''
    f_40835e = _cc(64, 131, 94, True)
    '''## 緑青色'''
    f_411445 = _cc(65, 20, 69, True)
    '''## 紫绀色'''
    f_412f1f = _cc(65, 47, 31, True)
    '''## 涅色'''
    f_426ab3 = _cc(66, 106, 179, True)
    '''## 杜若色'''
    f_444693 = _cc(68, 70, 147, True)
    '''## 绀桔梗色'''
    f_45224a = _cc(69, 34, 74, True)
    '''## 茄子绀色'''
    f_454926 = _cc(69, 73, 38, True)
    '''## 媚茶色'''
    f_45b97c = _cc(69, 185, 124, True)
    '''## 绿色'''
    f_464547 = _cc(70, 69, 71, True)
    '''## 墨色'''
    f_46485f = _cc(70, 72, 95, True)
    '''## 胜色'''
    f_472d56 = _cc(71, 45, 86, True)
    '''## 葡萄色'''
    f_494e8f = _cc(73, 78, 143, True)
    '''## 绀蓝色'''
    f_4a3113 = _cc(74, 49, 19, True)
    '''## 银煤竹色'''
    f_4b2f3d = _cc(75, 47, 61, True)
    '''## 浓色'''
    f_4d4f36 = _cc(77, 79, 54, True)
    '''## 青钝色'''
    f_4e72b8 = _cc(78, 114, 184, True)
    '''## 群青色'''
    f_4f5555 = _cc(79, 85, 85, True)
    '''## 钝色'''
    f_508a88 = _cc(80, 138, 136, True)
    '''## 锖浅葱色'''
    f_50b7c1 = _cc(80, 183, 193, True)
    '''## 新桥色'''
    f_525f42 = _cc(82, 95, 66, True)
    '''## 山鸠色'''
    f_53261f = _cc(83, 38, 31, True)
    '''## 赤褐色'''
    f_54211d = _cc(84, 33, 29, True)
    '''## 深绯色'''
    f_543044 = _cc(84, 48, 68, True)
    '''## 灭紫色'''
    f_563624 = _cc(86, 54, 36, True)
    '''## 黑茶色'''
    f_56452d = _cc(86, 69, 45, True)
    '''## 黄枯茶色'''
    f_585eaa = _cc(88, 94, 170, True)
    '''## 桔梗色'''
    f_594c6d = _cc(89, 76, 109, True)
    '''## 鸠羽鼠色'''
    f_596032 = _cc(89, 96, 50, True)
    '''## 鶸茶色'''
    f_5c7a29 = _cc(92, 122, 41, True)
    '''## 苔色'''
    f_5e7c85 = _cc(94, 124, 133, True)
    '''## 蓝鼠色'''
    f_5f3c23 = _cc(95, 60, 35, True)
    '''## 枯茶色'''
    f_5f5d46 = _cc(95, 93, 70, True)
    '''## 生壁色'''
    f_63434f = _cc(99, 67, 79, True)
    '''## 葡萄鼠色'''
    f_64492b = _cc(100, 73, 43, True)
    '''## 黄栌色'''
    f_65c294 = _cc(101, 194, 148, True)
    '''## 若竹色'''
    f_694d9f = _cc(105, 77, 159, True)
    '''## 菖蒲色'''
    f_6950a1 = _cc(105, 80, 161, True)
    '''## 青紫色'''
    f_69541b = _cc(105, 84, 27, True)
    '''## 国防色'''
    f_6a3427 = _cc(106, 52, 39, True)
    '''## 锖色'''
    f_6a6da9 = _cc(106, 109, 169, True)
    '''## 藤纳戸色'''
    f_6b2c25 = _cc(107, 44, 37, True)
    '''## 栗梅色'''
    f_6b473c = _cc(107, 71, 60, True)
    '''## 焦茶色'''
    f_6c4c49 = _cc(108, 76, 73, True)
    '''## 煤竹色'''
    f_6d5826 = _cc(109, 88, 38, True)
    '''## 莺茶色'''
    f_6d8346 = _cc(109, 131, 70, True)
    '''## 草色'''
    f_6e6b41 = _cc(110, 107, 65, True)
    '''## 海松色'''
    f_6f599c = _cc(111, 89, 156, True)
    '''## 江戸紫色'''
    f_6f60aa = _cc(111, 96, 170, True)
    '''## 菫色'''
    f_6f6d85 = _cc(111, 109, 133, True)
    '''## 薄鼠色'''
    f_705628 = _cc(112, 86, 40, True)
    '''## 黄橡色'''
    f_70a19f = _cc(112, 161, 159, True)
    '''## 水浅葱色'''
    f_726930 = _cc(114, 105, 48, True)
    '''## 利久色'''
    f_72777b = _cc(114, 119, 123, True)
    '''## 铅色'''
    f_72baa7 = _cc(114, 186, 167, True)
    '''## 青竹色'''
    f_733a31 = _cc(115, 58, 49, True)
    '''## 海老茶色'''
    f_73b9a2 = _cc(115, 185, 162, True)
    '''## 青磁色'''
    f_74787c = _cc(116, 120, 124, True)
    '''## 薄墨色'''
    f_74905d = _cc(116, 144, 93, True)
    '''## 松叶色'''
    f_76624c = _cc(118, 98, 76, True)
    '''## 空五倍子色'''
    f_769149 = _cc(118, 145, 73, True)
    '''## 苗色'''
    f_76becc = _cc(118, 190, 204, True)
    '''## 秘色'''
    f_77787b = _cc(119, 120, 123, True)
    '''## 灰色'''
    f_77ac98 = _cc(119, 172, 152, True)
    '''## 千草色'''
    f_78331e = _cc(120, 51, 30, True)
    '''## 赤铜色'''
    f_78a355 = _cc(120, 163, 85, True)
    '''## 柳色'''
    f_78cdd1 = _cc(120, 205, 209, True)
    '''## 白群色'''
    f_7a1723 = _cc(122, 23, 35, True)
    '''## 绯色'''
    f_7bbfea = _cc(123, 191, 234, True)
    '''## 勿忘草色'''
    f_7c8577 = _cc(124, 133, 119, True)
    '''## 利休鼠色'''
    f_7d5886 = _cc(125, 88, 134, True)
    '''## 古代紫色'''
    f_7f7522 = _cc(127, 117, 34, True)
    '''## 伽罗色'''
    f_7fb80e = _cc(127, 184, 14, True)
    '''## 若緑色'''
    f_80752c = _cc(128, 117, 44, True)
    '''## 青丹色'''
    f_817936 = _cc(129, 121, 54, True)
    '''## 油色'''
    f_826858 = _cc(130, 104, 88, True)
    '''## 丁子茶色'''
    f_840228 = _cc(132, 2, 40, True)
    '''## 真红色'''
    f_84331f = _cc(132, 51, 31, True)
    '''## 赤锖色'''
    f_843900 = _cc(132, 57, 0, True)
    '''## 褐色'''
    f_845538 = _cc(132, 85, 56, True)
    '''## 胡桃色'''
    f_84bf96 = _cc(132, 191, 150, True)
    '''## 浅緑色'''
    f_853f04 = _cc(133, 63, 4, True)
    '''## 焦香色'''
    f_8552a1 = _cc(133, 82, 161, True)
    '''## 紫色'''
    f_867892 = _cc(134, 120, 146, True)
    '''## 鸠羽色'''
    f_87481f = _cc(135, 72, 31, True)
    '''## 桦茶色'''
    f_87843b = _cc(135, 132, 59, True)
    '''## 莺色'''
    f_892f1b = _cc(137, 47, 27, True)
    '''## 弁柄色'''
    f_896a45 = _cc(137, 106, 69, True)
    '''## 朽叶色'''
    f_8a2e3b = _cc(138, 46, 59, True)
    '''## 浅苏芳色'''
    f_8a5d19 = _cc(138, 93, 25, True)
    '''## 饴色'''
    f_8a8c8e = _cc(138, 140, 142, True)
    '''## 鼠色'''
    f_8c531b = _cc(140, 83, 27, True)
    '''## 丁子色'''
    f_8e3e1f = _cc(142, 62, 31, True)
    '''## 栗色'''
    f_8e453f = _cc(142, 69, 63, True)
    '''## 鸢色'''
    f_8e7437 = _cc(142, 116, 55, True)
    '''## 香色'''
    f_8f4b2e = _cc(143, 75, 46, True)
    '''## 茶色'''
    f_8f4b38 = _cc(143, 75, 56, True)
    '''## 桧皮色'''
    f_8f4b4a = _cc(143, 75, 74, True)
    '''## 小豆色'''
    f_905a3d = _cc(144, 90, 61, True)
    '''## 灰茶色'''
    f_905d1d = _cc(144, 93, 29, True)
    '''## 路考茶色'''
    f_90d7ec = _cc(144, 215, 236, True)
    '''## 空色'''
    f_918597 = _cc(145, 133, 151, True)
    '''## 薄色'''
    f_94d6da = _cc(148, 214, 218, True)
    '''## 瓮覗色'''
    f_96582a = _cc(150, 88, 42, True)
    '''## 狐色'''
    f_973c3f = _cc(151, 60, 63, True)
    '''## 苏芳色'''
    f_987165 = _cc(152, 113, 101, True)
    '''## 梅染色'''
    f_999d9c = _cc(153, 157, 156, True)
    '''## 薄钝色'''
    f_9b95c9 = _cc(155, 149, 201, True)
    '''## 藤紫色'''
    f_9d9087 = _cc(157, 144, 135, True)
    '''## 茶鼠色'''
    f_a03939 = _cc(160, 57, 57, True)
    '''## 红海老茶色'''
    f_a1a3a6 = _cc(161, 163, 166, True)
    '''## 银鼠色'''
    f_a3cf62 = _cc(163, 207, 98, True)
    '''## 萌黄色'''
    f_a7324a = _cc(167, 50, 74, True)
    '''## 红色'''
    f_a7573b = _cc(167, 87, 59, True)
    '''## 赭色'''
    f_aa2116 = _cc(170, 33, 22, True)
    '''## 绯色'''
    f_aa363d = _cc(170, 54, 61, True)
    '''## 银朱色'''
    f_abc88b = _cc(171, 200, 139, True)
    '''## 若草色'''
    f_ac6767 = _cc(172, 103, 103, True)
    '''## 退红色'''
    f_ad8b3d = _cc(173, 139, 61, True)
    '''## 木兰色'''
    f_ae5039 = _cc(174, 80, 57, True)
    '''## 炼瓦色'''
    f_ae6642 = _cc(174, 102, 66, True)
    '''## 土器色'''
    f_afb4db = _cc(175, 180, 219, True)
    '''## 藤色'''
    f_afdfe4 = _cc(175, 223, 228, True)
    '''## 水色'''
    f_b22c46 = _cc(178, 44, 70, True)
    '''## 茜色'''
    f_b2d235 = _cc(178, 210, 53, True)
    '''## 黄緑色'''
    f_b3424a = _cc(179, 66, 74, True)
    '''## 臙脂色'''
    f_b36d41 = _cc(179, 109, 65, True)
    '''## 土色'''
    f_b4532a = _cc(180, 83, 42, True)
    '''## 代赭色'''
    f_b4533c = _cc(180, 83, 60, True)
    '''## 赤茶色'''
    f_b4534b = _cc(180, 83, 75, True)
    '''## 红桦色'''
    f_b54334 = _cc(181, 67, 52, True)
    '''## 土色'''
    f_b64533 = _cc(182, 69, 51, True)
    '''## 丹色'''
    f_b69968 = _cc(182, 153, 104, True)
    '''## 亜麻色'''
    f_b76f40 = _cc(183, 111, 64, True)
    '''## 琥珀色'''
    f_b7704f = _cc(183, 112, 79, True)
    '''## 骆驼色'''
    f_b7ba6b = _cc(183, 186, 107, True)
    '''## 抹茶色'''
    f_ba8448 = _cc(186, 132, 72, True)
    '''## 黄土色'''
    f_bb505d = _cc(187, 80, 93, True)
    '''## 今様色'''
    f_bd6758 = _cc(189, 103, 88, True)
    '''## 曙色'''
    f_bed742 = _cc(190, 215, 66, True)
    '''## 若草色'''
    f_c1a173 = _cc(193, 161, 115, True)
    '''## 枯色'''
    f_c37e00 = _cc(195, 126, 0, True)
    '''## 黄金色'''
    f_c37e00 = _cc(195, 126, 0, True)
    '''## 金色'''
    f_c63c26 = _cc(198, 60, 38, True)
    '''## 桦色'''
    f_c76968 = _cc(199, 105, 104, True)
    '''## 真赭色'''
    f_c77eb5 = _cc(199, 126, 181, True)
    '''## 菖蒲色'''
    f_c7a252 = _cc(199, 162, 82, True)
    '''## 芥子色'''
    f_c85d44 = _cc(200, 93, 68, True)
    '''## 桦色'''
    f_c88400 = _cc(200, 132, 0, True)
    '''## 萱草色'''
    f_c99979 = _cc(201, 153, 121, True)
    '''## 洗柿色'''
    f_ca8687 = _cc(202, 134, 135, True)
    '''## 薄柿色'''
    f_cbc547 = _cc(203, 197, 71, True)
    '''## 鶸色'''
    f_cd9a5b = _cc(205, 154, 91, True)
    '''## 肉色'''
    f_cd9a5b = _cc(205, 154, 91, True)
    '''## 人色'''
    f_cde6c7 = _cc(205, 230, 199, True)
    '''## 白緑色'''
    f_d1923f = _cc(209, 146, 63, True)
    '''## 朽叶色'''
    f_d1c7b7 = _cc(209, 199, 183, True)
    '''## 石竹色'''
    f_d2553d = _cc(210, 85, 61, True)
    '''## 洗朱色'''
    f_d3c6a6 = _cc(211, 198, 166, True)
    '''## 砂色'''
    f_d3d7d4 = _cc(211, 215, 212, True)
    '''## 乳白色'''
    f_d5c59f = _cc(213, 197, 159, True)
    '''## 练色'''
    f_d64f44 = _cc(214, 79, 68, True)
    '''## 赤丹色'''
    f_d71345 = _cc(215, 19, 69, True)
    '''## 红色'''
    f_d93a49 = _cc(217, 58, 73, True)
    '''## 红赤色'''
    f_d9d6c3 = _cc(217, 214, 195, True)
    '''## 灰白色'''
    f_da765b = _cc(218, 118, 91, True)
    '''## 肉桂色'''
    f_dbce8f = _cc(219, 206, 143, True)
    '''## 鸟子色'''
    f_de773f = _cc(222, 119, 63, True)
    '''## 黄茶色'''
    f_dea32c = _cc(222, 163, 44, True)
    '''## 栀子色'''
    f_deab8a = _cc(222, 171, 138, True)
    '''## 赤白橡色'''
    f_dec674 = _cc(222, 198, 116, True)
    '''## 淡黄色'''
    f_decb00 = _cc(222, 203, 0, True)
    '''## 緑黄色'''
    f_df9464 = _cc(223, 148, 100, True)
    '''## 小麦色'''
    f_e0861a = _cc(224, 134, 26, True)
    '''## 金茶色'''
    f_ea66a6 = _cc(234, 102, 166, True)
    '''## 牡丹色'''
    f_ed1941 = _cc(237, 25, 65, True)
    '''## 赤色'''
    f_ef4136 = _cc(239, 65, 54, True)
    '''## 红绯色'''
    f_ef5b9c = _cc(239, 91, 156, True)
    '''## 踯躅色'''
    f_f05b72 = _cc(240, 91, 114, True)
    '''## 蔷薇色'''
    f_f0dc70 = _cc(240, 220, 112, True)
    '''## 刈安色'''
    f_f15a22 = _cc(241, 90, 34, True)
    '''## 金赤色'''
    f_f15a22 = _cc(241, 90, 34, True)
    '''## 赤橙色'''
    f_f15b6c = _cc(241, 91, 108, True)
    '''## 韩红色'''
    f_f173ac = _cc(241, 115, 172, True)
    '''## 赤紫色'''
    f_f26522 = _cc(242, 101, 34, True)
    '''## 朱色'''
    f_f2eada = _cc(242, 234, 218, True)
    '''## 象牙色'''
    f_f36c21 = _cc(243, 108, 33, True)
    '''## 黄赤色'''
    f_f3704b = _cc(243, 112, 75, True)
    '''## 柿色'''
    f_f3715c = _cc(243, 113, 92, True)
    '''## 铅丹色'''
    f_f391a9 = _cc(243, 145, 169, True)
    '''## 薄红梅色'''
    f_f47920 = _cc(244, 121, 32, True)
    '''## 橙色'''
    f_f47a55 = _cc(244, 122, 85, True)
    '''## 黄丹色'''
    f_f58220 = _cc(245, 130, 32, True)
    '''## 蜜柑色'''
    f_f58f98 = _cc(245, 143, 152, True)
    '''## 桃色'''
    f_f69c9f = _cc(246, 156, 159, True)
    '''## 红梅色'''
    f_f6f5ec = _cc(246, 245, 236, True)
    '''## 生成色'''
    f_f7acbc = _cc(247, 172, 188, True)
    '''## 鸨色'''
    f_f8aba6 = _cc(248, 171, 166, True)
    '''## 珊瑚色'''
    f_faa755 = _cc(250, 167, 85, True)
    '''## 柑子色'''
    f_fab27b = _cc(250, 178, 123, True)
    '''## 杏色'''
    f_fcaf17 = _cc(252, 175, 23, True)
    '''## 山吹色'''
    f_fcf16e = _cc(252, 241, 110, True)
    '''## 黄檗色'''
    f_fdb933 = _cc(253, 185, 51, True)
    '''## 郁金色'''
    f_fedcbd = _cc(254, 220, 189, True)
    '''## 肌色'''
    f_feeeed = _cc(254, 238, 237, True)
    '''## 桜色'''
    f_ffc20e = _cc(255, 194, 14, True)
    '''## 向日葵色'''
    f_ffce7b = _cc(255, 206, 123, True)
    '''## 卵色'''
    f_ffd400 = _cc(255, 212, 0, True)
    '''## 黄色'''
    f_ffd900 = _cc(255, 217, 0, True)
    '''## 蒲公英色'''
    f_ffe600 = _cc(255, 230, 0, True)
    '''## 中黄色'''
    f_fffef9 = _cc(255, 254, 249, True)
    '''## 胡粉色'''
    f_fffffb = _cc(255, 255, 251, True)
    '''## 白色'''

del _cc, _dc
del _default_color

